rails-react/rails/app/graphql/types/query_type.rb

SELECT "users".* FROM "users"
---
    def my_field
      User.all.map(&:email)